# ─────────────────────────────────────────────
# Taps
# ─────────────────────────────────────────────
# Note: homebrew/bundle is built-in since Homebrew 5.x, no tap needed
tap "jesseduffield/lazygit"

# ─────────────────────────────────────────────
# Core tools
# ─────────────────────────────────────────────
brew "neovim"
brew "git"
brew "curl"
brew "wget"

# ─────────────────────────────────────────────
# Shell & prompt
# ─────────────────────────────────────────────
brew "starship"           # Fast cross-shell prompt
brew "zoxide"             # Smart cd (replaces cd with z)
brew "eza"                # Modern ls replacement
brew "bat"                # cat with syntax highlighting
brew "fzf"                # Fuzzy finder

# ─────────────────────────────────────────────
# Neovim dependencies
# ─────────────────────────────────────────────
brew "ripgrep"            # Fast grep (required by Telescope)
brew "fd"                 # Fast find (required by Telescope)
brew "tree-sitter"        # Parser (used by nvim-treesitter)
brew "lazygit"            # Git TUI (used inside Neovim)

# ─────────────────────────────────────────────
# Languages
# ─────────────────────────────────────────────
brew "go"
brew "python@3.12"
brew "dotnet"             # C# / Unity scripting (omnisharp needs this)

# ─────────────────────────────────────────────
# Node.js / Next.js
# ─────────────────────────────────────────────
brew "node"               # Required by LSPs, Next.js, etc.
brew "pnpm"               # Fast package manager (optional, remove if you use npm/yarn)

# ─────────────────────────────────────────────
# Java (for Quarkus work)
# ─────────────────────────────────────────────
brew "openjdk@21"
brew "maven"
brew "gradle"

# ─────────────────────────────────────────────
# Terminal
# ─────────────────────────────────────────────
cask "ghostty"

# ─────────────────────────────────────────────
# Fonts (Nerd Fonts for icons in Neovim)
# ─────────────────────────────────────────────
cask "font-fira-mono-nerd-font"
